source/_posts/android设计与实现学习笔记.org
#+TITLE: Android 设计与实现 学习笔记
#+DATE: <2015-06-05>
#+TAGS: android
#+LAYOUT: post

* Android 设计与实现 学习笔记
#+BEGIN_HTML
<!-- more -->
#+END_HTML
** JNI

*** JNI方法全名规则

   java方法：public static native boolean isLoggable(String tag, int level)
   JNI方法：static jboolean android_util_Log_isLoggable(JNIEnv* env, jobject clazz, jstring tag, jint level)

*** JNI引用类型与JAVA引用类型的转化关系

   | Java类型            | JNI类型       |
   |---------------------+---------------|
   | java.lang.Class     | jclass        |
   | java.lang.String    | jstring       |
   | java.lang.Throwable | jthrowable    |
   | object[]            | jobjectArray  |
   | boolean[]           | jbooleanArray |
   | byte[]              | jbyteArray    |
   | char[]              | jcharArray    |
   | short[]             | jshortArray   |
   | int[]               | jintArray     |
   | long[]              | jlongArray    |
   | float[]             | jfloatArray   |
   | double[]            | jdoubleArray  |

*** JNI方法签名规则

  | Java类型 | 类型签名      |
  |----------+---------------|
  | boolean  | Z             |
  | byte     | B             |
  | chat     | C             |
  | long     | J             |
  | float    | F             |
  | double   | D             |
  | short    | S             |
  | int      | I             |
  | 类       | L全限定类名;  |
  | 数组     | [元素类型签名 |

*** JNI操作域与方法的函数

   | 访问对象域     | 调用实例方法               | 访问静态域           | 调用静态方法           |
   |----------------+----------------------------+----------------------+------------------------|
   | GetFieldID     | GetMethodID                | GetStaticFieldID     | GetStaticMethodID      |
   | Get<Type>Field | Call<Type>Method           | GetStatic<Type>Field | CallStatic<Type>Method |
   | Set<Type>Field | CallNonvirtual<Type>Method | SetStatic<Type>Field |                        |

*** JNI引用
   | 引用类型   | 是否增加引用计数 | 作用范围 | 生命周期                                                                                                     |
   |------------+------------------+----------+--------------------------------------------------------------------------------------------------------------|
   | 局部引用   | 可以增加引用计数 | 本线程   | 一次Native调用，只在创建它的Native方法的线程中有效，并且只在Native方法的一次调用中有效，在方法返回后，被回收 |
   | 全局引用   | 可以增加引用计数 | 多线程   | 多个Native方法，生命周期到显式释放。通过引用JNI函数NewGlobalRef创建，通过DeleteGlobalRef释放                 |
   | 弱全局引用 | 不能增加引用计数 | 多线程   | 生命周期到显式释放。通过NewWeakGlobalRef创建，通过DeleteWeakGlobalRef释放，通过IsSameObject判断是否被回收    |

   if (env->isSameObject(weak_ref, NULL) == JNI_TRUE) 那么引用被释放

   *全局引用，默认不能超过2000个。如果超过，在logcat中会看到"GREF overflow"*

*** JNI异常处理

    检查异常的方法有：
    - 检查上一次JNI函数调用的返回值是否为NULL
    - 通过调用JNI函数ExceptionOccurred()来判断是否发生异常

    检查到异常后必须予以处理：
    - 立即返回，异常会在Java代码中抛出
    - 调用ExceptionClear()来清除异常

    | JNI异常处理函数   | 功能描述                           |
    |-------------------+------------------------------------|
    | Throw             | 抛出现有异常                       |
    | ThrowNew          | 抛出新的异常                       |
    | ExceptionOccurred | 判断是否发生异常，并获得异常的引用 |
    | ExceptionCheck    | 判断是否发生异常                   |
    | ExceptionDescribe | 异常堆栈信息                       |
    | ExceptionClear    | 清除一个未处理的异常               |
    | FatalError        | 严重错误，退出                     |


** 启动

*** 启动流程
1. 执行bootloader
2. 调用start_kernel进入内核启动阶段，最终启动用户空间的init程序
3. init解析init.rc配置文件，开启zygote与ServiceManager两个守护进程。zygote为Android启动的第一个Dalvik虚拟机，ServiceManager是Binder通信的基础。
4. zygote定义socket，用于接收ActivityManagerService启动应用程序的请求
5. zygote虚拟机启动system_server子进程。
6. system_server进程的init1与init2阶段分别启动Native System Service和Java System Service
7. 在system_server中开启Android核心服务，并添加入ServiceManager中。设置系统为systemReady状态。
8. ActivityManagerService与zygote中的Socket通信，通过zygote启动Home应用，进入系统桌面。
9. zygote收到ActivityManagerService连接请求，执行runSelectLoopMode
10. zygote处理请求通过forkAndSpecialize启动新的应用进程，并最终启动HOME

*** 内核引导阶段
- kernel/arch/arm/kernel/head.S
- kernel/arch/arm/kernel/head-common.S

*** 内核启动阶段
1. kernel/init/main.c -> start_kernel函数
2. rest_init -> kernel_init与kthreadd进程
   kernel_init -> init_post -> /init 程序，或：/sbin/init, /etc/init, /bin/init, /bin/sh -> run_init_process

*** init进程执行过程
- 创建 /proc, /sys, tmpfs, /dev/pts, /dev/socket, devpts, proc, sysfs 这些目录
- 解析init.rc初始化文件
- 触发build in的Action -> queue_builtin_action, 这些action并没有在init.rc或者init.<hardware>.rc中配置
- 重新启动异常退出的Service
- 监听来自属性服务property service
- 监控signal，接收子进程异常退出后抛出的SIGCHLD信号，回收子进程资源或者重启子进程
- 监听来自keychord设备的事件

