source/_posts/2015-07-01-android设计与实现学习笔记.md
---
layout: post
title: Android 设计与实现 学习笔记
categories: android
date: 2015-05-17
tags: [android]
---

# Table of Contents

1.  [Android 设计与实现 学习笔记](#orgef119aa)
    1.  [JNI](#org0b72cde)
        1.  [JNI方法全名规则](#org1bb742b)
        2.  [JNI引用类型与JAVA引用类型的转化关系](#orgb31f5bb)
        3.  [JNI方法签名规则](#org0b4e615)
        4.  [JNI操作域与方法的函数](#orgc09ab0c)
        5.  [JNI引用](#org7e81c90)
        6.  [JNI异常处理](#orgb2b8934)
    2.  [启动](#orgc344ef0)
        1.  [启动流程](#org9f72ffc)
        2.  [内核引导阶段](#org75472b5)
        3.  [内核启动阶段](#org4345489)
        4.  [init进程执行过程](#orgcee7684)
        5.  [init.rc文件](#org5541769)
        6.  [执行Action，Service与属性服务](#org508a948)
        7.  [进入Java世界](#orgc7d5e68)
    3.  [Binder](#orgcdb405e)
    4.  [消息通信篇](#orgca9e6a3)
    5.  [Package Manager](#org24ccfa5)
        1.  [结构](#orgc6c0fa6)
        2.  [启动](#org0229d25)
        3.  [APK安装过程](#orgd6f62b7)
    6.  [Activity Manager](#org094957a)
        1.  [机制与实现](#org92e1626)
        2.  [应用程序Activity的启动和调度](#orgd6f15d9)
        3.  [Activity Manager进程管理](#org0d6dbed)



<a id="orgef119aa"></a>

# Android 设计与实现 学习笔记

<div class="HTML">
<!&#x2013; more &#x2013;>

</div>


<a id="org0b72cde"></a>

## JNI


<a id="org1bb742b"></a>

### JNI方法全名规则

java方法：public static native boolean isLoggable(String tag, int level)
JNI方法：static jboolean android<sub>util</sub><sub>Log</sub><sub>isLoggable</sub>(JNIEnv\* env, jobject clazz, jstring tag, jint level)


<a id="orgb31f5bb"></a>

### JNI引用类型与JAVA引用类型的转化关系

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Java类型</th>
<th scope="col" class="org-left">JNI类型</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">java.lang.Class</td>
<td class="org-left">jclass</td>
</tr>


<tr>
<td class="org-left">java.lang.String</td>
<td class="org-left">jstring</td>
</tr>


<tr>
<td class="org-left">java.lang.Throwable</td>
<td class="org-left">jthrowable</td>
</tr>


<tr>
<td class="org-left">object[]</td>
<td class="org-left">jobjectArray</td>
</tr>


<tr>
<td class="org-left">boolean[]</td>
<td class="org-left">jbooleanArray</td>
</tr>


<tr>
<td class="org-left">byte[]</td>
<td class="org-left">jbyteArray</td>
</tr>


<tr>
<td class="org-left">char[]</td>
<td class="org-left">jcharArray</td>
</tr>


<tr>
<td class="org-left">short[]</td>
<td class="org-left">jshortArray</td>
</tr>


<tr>
<td class="org-left">int[]</td>
<td class="org-left">jintArray</td>
</tr>


<tr>
<td class="org-left">long[]</td>
<td class="org-left">jlongArray</td>
</tr>


<tr>
<td class="org-left">float[]</td>
<td class="org-left">jfloatArray</td>
</tr>


<tr>
<td class="org-left">double[]</td>
<td class="org-left">jdoubleArray</td>
</tr>
</tbody>
</table>


<a id="org0b4e615"></a>

### JNI方法签名规则

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Java类型</th>
<th scope="col" class="org-left">类型签名</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">boolean</td>
<td class="org-left">Z</td>
</tr>


<tr>
<td class="org-left">byte</td>
<td class="org-left">B</td>
</tr>


<tr>
<td class="org-left">chat</td>
<td class="org-left">C</td>
</tr>


<tr>
<td class="org-left">long</td>
<td class="org-left">J</td>
</tr>


<tr>
<td class="org-left">float</td>
<td class="org-left">F</td>
</tr>


<tr>
<td class="org-left">double</td>
<td class="org-left">D</td>
</tr>


<tr>
<td class="org-left">short</td>
<td class="org-left">S</td>
</tr>


<tr>
<td class="org-left">int</td>
<td class="org-left">I</td>
</tr>


<tr>
<td class="org-left">类</td>
<td class="org-left">L全限定类名;</td>
</tr>


<tr>
<td class="org-left">数组</td>
<td class="org-left">[元素类型签名</td>
</tr>
</tbody>
</table>


<a id="orgc09ab0c"></a>

### JNI操作域与方法的函数

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">访问对象域</th>
<th scope="col" class="org-left">调用实例方法</th>
<th scope="col" class="org-left">访问静态域</th>
<th scope="col" class="org-left">调用静态方法</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">GetFieldID</td>
<td class="org-left">GetMethodID</td>
<td class="org-left">GetStaticFieldID</td>
<td class="org-left">GetStaticMethodID</td>
</tr>


<tr>
<td class="org-left">Get<Type>Field</td>
<td class="org-left">Call<Type>Method</td>
<td class="org-left">GetStatic<Type>Field</td>
<td class="org-left">CallStatic<Type>Method</td>
</tr>


<tr>
<td class="org-left">Set<Type>Field</td>
<td class="org-left">CallNonvirtual<Type>Method</td>
<td class="org-left">SetStatic<Type>Field</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<a id="org7e81c90"></a>

### JNI引用

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">引用类型</th>
<th scope="col" class="org-left">是否增加引用计数</th>
<th scope="col" class="org-left">作用范围</th>
<th scope="col" class="org-left">生命周期</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">局部引用</td>
<td class="org-left">可以增加引用计数</td>
<td class="org-left">本线程</td>
<td class="org-left">一次Native调用，只在创建它的Native方法的线程中有效，并且只在Native方法的一次调用中有效，在方法返回后，被回收</td>
</tr>


<tr>
<td class="org-left">全局引用</td>
<td class="org-left">可以增加引用计数</td>
<td class="org-left">多线程</td>
<td class="org-left">多个Native方法，生命周期到显式释放。通过引用JNI函数NewGlobalRef创建，通过DeleteGlobalRef释放</td>
</tr>


<tr>
<td class="org-left">弱全局引用</td>
<td class="org-left">不能增加引用计数</td>
<td class="org-left">多线程</td>
<td class="org-left">生命周期到显式释放。通过NewWeakGlobalRef创建，通过DeleteWeakGlobalRef释放，通过IsSameObject判断是否被回收</td>
</tr>
</tbody>
</table>

if (env->isSameObject(weak<sub>ref</sub>, NULL) == JNI<sub>TRUE</sub>) 那么引用被释放

**全局引用，默认不能超过2000个。如果超过，在logcat中会看到"GREF overflow"**


<a id="orgb2b8934"></a>

### JNI异常处理

检查异常的方法有：

-   检查上一次JNI函数调用的返回值是否为NULL
-   通过调用JNI函数ExceptionOccurred()来判断是否发生异常

检查到异常后必须予以处理：

-   立即返回，异常会在Java代码中抛出
-   调用ExceptionClear()来清除异常

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">JNI异常处理函数</th>
<th scope="col" class="org-left">功能描述</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Throw</td>
<td class="org-left">抛出现有异常</td>
</tr>


<tr>
<td class="org-left">ThrowNew</td>
<td class="org-left">抛出新的异常</td>
</tr>


<tr>
<td class="org-left">ExceptionOccurred</td>
<td class="org-left">判断是否发生异常，并获得异常的引用</td>
</tr>


<tr>
<td class="org-left">ExceptionCheck</td>
<td class="org-left">判断是否发生异常</td>
</tr>


<tr>
<td class="org-left">ExceptionDescribe</td>
<td class="org-left">异常堆栈信息</td>
</tr>


<tr>
<td class="org-left">ExceptionClear</td>
<td class="org-left">清除一个未处理的异常</td>
</tr>


<tr>
<td class="org-left">FatalError</td>
<td class="org-left">严重错误，退出</td>
</tr>
</tbody>
</table>


<a id="orgc344ef0"></a>

## 启动


<a id="org9f72ffc"></a>

### 启动流程

1.  执行bootloader
2.  调用start<sub>kernel进入内核启动阶段</sub>，最终启动用户空间的init程序
3.  init解析init.rc配置文件，开启zygote与ServiceManager两个守护进程。zygote为Android启动的第一个Dalvik虚拟机，ServiceManager是Binder通信的基础。
4.  zygote定义socket，用于接收ActivityManagerService启动应用程序的请求
5.  zygote虚拟机启动system<sub>server子进程</sub>。
6.  system<sub>server进程的init1与init2阶段分别启动Native</sub> System Service和Java System Service
7.  在system<sub>server中开启Android核心服务</sub>，并添加入ServiceManager中。设置系统为systemReady状态。
8.  ActivityManagerService与zygote中的Socket通信，通过zygote启动Home应用，进入系统桌面。
9.  zygote收到ActivityManagerService连接请求，执行runSelectLoopMode
10. zygote处理请求通过forkAndSpecialize启动新的应用进程，并最终启动HOME


<a id="org75472b5"></a>

### 内核引导阶段

-   kernel/arch/arm/kernel/head.S
-   kernel/arch/arm/kernel/head-common.S


<a id="org4345489"></a>

### 内核启动阶段

1.  kernel/init/main.c -> start<sub>kernel函数</sub>
2.  rest<sub>init</sub> -> kernel<sub>init与kthreadd进程</sub>
    kernel<sub>init</sub> -> init<sub>post</sub> -> /init 程序，或：/sbin/init, /etc/init, /bin/init, /bin/sh -> run<sub>init</sub><sub>process</sub>


<a id="orgcee7684"></a>

### init进程执行过程

-   创建 /proc, /sys, tmpfs, /dev/pts, /dev/socket, devpts, proc, sysfs 这些目录
-   解析init.rc初始化文件
-   触发build in的Action -> queue<sub>builtin</sub><sub>action</sub>, 这些action并没有在init.rc或者init.<hardware>.rc中配置
-   重新启动异常退出的Service
-   监听来自属性服务property service
-   监控signal，接收子进程异常退出后抛出的SIGCHLD信号，回收子进程资源或者重启子进程
-   监听来自keychord设备的事件
