source/_posts/2015-07-01-android设计与实现学习笔记.md


<a id="orgcdb405e"></a>

## Binder

1.  初始化Binder通信

2.  将自身注册为Context管理者

3.  循环处理IPC请求

4.  Server启动

    1.  创建ProcessState对象
    2.  获取servicemanager代理对象
        -   Binder通信接口: IBinder, BBinder（Server对应的Binder对象）, BpBinder（Client访问BBinder的代理对象）
        -   Binder服务接口：Server端提供的服务，由IServiceManager提供
        -   Proxy：BpInterface继承自BpRefBase，BpRefBase.mRemote指向Client的BpBinder对象。BpServiceManager实现服务接口中声明的方法
        -   Stub：BnInterface，BnServerManager
    3.  注册Service
    4.  Server进程开启线程池

5.  Binder在Native中的实现

6.  Binder在Java层中的实现

7.  Java系统服务注册过程

    BinderInternal.getContextObject -> IBinder -> ServiceManagerNative.asInteface -> sServiceManager -> addService
    
    1.  BinderInternal.getContextObject
    2.  ServiceManagerNative.asInterface
    3.  ServiceManagerProxy.addService
        1.  Java的Service对象写入Parcel中
        2.  使用transact方法进行ipc通信

8.  Client获取服务代理

    1.  获取服务的Proxy
    2.  Proxy.Stub.asInterface
    3.  new SomeServer(SomeServerInterface, Thread)

9.  Client调用Java系统服务的方法

10. AIDL


<a id="orgca9e6a3"></a>

## 消息通信篇

1.  Handler.post(Runnable r) -> Handler.sendMessageDelayed(getPostMessage(r), 0) -> Message m.callback = r
2.  Handler.dispatchMessage -> msg.callback != null -> callback
    -> msg.handleMessage != null -> callback.handleMessage
    -> handleMessage
3.  MessageQueue.IdleHandler
4.  Message.recycle
5.  AsyncTask.execute -> executeOnExecutor(SerialExecutor, params) -> SerialExecutor.execute(mFuture)
    -   会通过一个ThreadPoolExecutor来执行线程


<a id="org24ccfa5"></a>

## Package Manager

-   Permission, Permission Group信息的增加，删除，查询和检查
-   扫描并安装和卸载APK包，查询包的UID，GID，包名，系统默认程序
-   比较两个包的签名
-   查询Activity，Provider、Receiver、Service信息
-   查询Application、Package、Resouce、Shared、Library、Feature信息
-   Intent匹配


<a id="orgc6c0fa6"></a>

### 结构

-   adb push -> adb install -r -l -s -> adb uninstall

-   Google Market、PackageInstaller.apk、第三方安装界面

-   PackageManager及其子类、adb与pm命令 -> binder通信 -> PackageManagerService方法

-   PackageManagerService及其相关类 Setting、Installer、FileObserver、DefaultContainerService


<a id="org0229d25"></a>

### 启动

1.  SystemServer.Init2() -> ServerThread.run() -> PackageManagerService.main()
2.  PackageManagerService pms = new PackageManagerService(context, factoryTest, onlyCore)
3.  创建并初始化Setting对象
4.  获取系统默认设置
5.  启动PackageHandler
6.  创建data目录并初始化UserManager
7.  解析data/system目录下的package.xml、packages-backup.xml
8.  dexopt优化
9.  启动FileObserver监控APK文件的目录
10. 调用scanDirLI扫描并安装APK
11. writeLPr更新package.xml, packages-backup.xml

uid >= FIRST<sub>APPLICATION</sub><sub>UID</sub> 或者 uid < FIRST<sub>APPLICATION</sub><sub>UID</sub>，FIST<sub>APPLICATION</sub><sub>UID</sub> < 10000为系统程序UID。

1.  <permission>

    -   <group>用于为指定的组ID分配权限
    -   <assign<sub>permission</sub>>用于为指定的用户ID分配指定的权限
    -   <library>指定的系统扩展库

2.  <feature>

    -   Hardware feature 指定当前设备支持的硬件特性：Audio、Bluetooth、Camera、Location、Microphone、NFC、Sensors、Screen、Telephony、Touchscreen、USB、WIFI。
    -   Software feature SIP VOIP
    
    PackageManager的hasSystemFeature, getSystemAvailableFeatures

3.  FileObserver监控

    -   system/framework
    -   system/app
    -   vendor/app
    -   data/app
    -   data/app-private

4.  scanDirLI

    -   system/framework/
    -   system/app/
    -   vendor/app/
    -   data/app
    -   data/app-private


<a id="orgd6f62b7"></a>

### APK安装过程

-   读取目录
-   解析AndroidManifest.xml


<a id="org094957a"></a>

## Activity Manager


<a id="org92e1626"></a>

### 机制与实现

-   启动、杀死应用程序
-   启动并调度Activity生命周期
-   启动并调度应用程序Service生命周期
-   注册Broadcast Receiver，并接收和分发Broadcast
-   启动并发布Content Provider
-   调度Task
-   检查、授予、收回访问URI权限
-   处理crash
-   调整进程调度优先级及策略
-   查询当前系统运行状态

ActivityThread：管理应用程序所在进程的主线程的执行调度和运行Activities，broadcast

Instrumentation：应用程序测量工具基类，用于监控系统与应用程序间的交互

ContextImpl：context的通用实现类

Context2： 可以获取应用程序运行环境中的一些全局信息的接口

Application：一个可以维护全局的应用程序状态的基类

1.  初始化一个单例的Context对象，使其与Resource、LoadApk、ActivityThread、ApplicationContentResolver关联
2.  创建Application对象，并与Context关联
3.  创建ActivityStack类，管理Activity栈并维护其状态
4.  startRunning
5.  ActivityManagerService.setSystemProcess
6.  installSystemProviders
7.  查询、安装Content Provider -> publishContentProvider
8.  systemReady
    1.  发送ACTION<sub>PRE</sub><sub>BOOT</sub><sub>COMPLETED广播</sub>：CalendarProvider、ContactsProvider、MediaProvider
    2.  清理预启动的非persistent进程
    3.  读取Settings配置： always<sub>finish</sub><sub>activities</sub>
    4.  Runnable回调接口：SystemUIService、BatteryService、NetworkManagementService、Watchdog
    5.  启动persistent应用和Home
    6.  发送ACTION<sub>BOOT</sub><sub>COMPLETED广播</sub>


<a id="orgd6f15d9"></a>

### 应用程序Activity的启动和调度

Launcher.onClick -> Launcher.startActivitySafely -> Launcher.startActivity -> Launch.parent.startActivity -> Activity.startActivityForResult(requestCode = -1) -> Instrumentation.execStartActivity -> ActivityManagerProxy.startActivity -> BinderProxy.transact(START<sub>ACTIVITY</sub><sub>TRANSACTION</sub>)

ActivityManagerService.startActivityMayWait -> ActivityStack.startActivityLock -> ActivityStack.startActivityUncheckedLocked -> ActivityStack.startActivityLocked -> ActivityStack.resumeTopActivity

ActivityManagerService.startActivityMayWait

int index = indexOfTokenLocked -> resultCode = mHistory.get(index) -> sendActivityResultLocked

FLAG<sub>ACTIVITY</sub><sub>NEW</sub><sub>TASK</sub>：

-   sourceRecord == null (由Launch或者adb start)
-   sourceRecord 启动模式为singleInstance
-   要启动的目标为singleInstance或者singleTask

用户行为导致Activity切换 -> 回调Activity.onUserLeaveHint

可利用Task：

-   目标非singleInstance：
    1.  ActivityRecord.affinity == Activity.affinity
    2.  ActivityRecord.Task.Intent.Component == Activity.Component
    3.  ActivityRecord.Task.affinityIntent.Component == Activity.Component
-   目标为singleInstance，ActivityRecord.Task.Intent.Component == Activity.Component

启动Activity的第二个阶段为Pause

1.  ActivityStack.startPausingLocked
2.  schedulePauseActivity
3.  handlePauseActivity
4.  performPauseActivity
5.  activityPaused
6.  completedPauseLocked

启动应用程序进程

-   会根据新的Activity是否占满屏来决定前一个Activity是否可见
-   如果systemReady 没有设为true，则先启动的应用程序都加入mProcessesOnHold列表中等待

加载应用程序Activity

-   ActivityThread.main创建出程序主线程
-   ActivityThread.attch将应用程序加入到ActivityManagerService中
-   ActivityManagerService.attachApplication
-   ApplicationThread.bindApplication
-   ActivityThread.handleBindApplication
    1.  设置进程名
    2.  低内存设备禁用硬件加速
    3.  创建应用程序对应的Application
    4.  安装ContentProvider
    5.  Instrumentation的onCreate方法
    6.  Application的onCreate方法

显示Activity

1.  ActivityStack.realStartActivityLocked：加载Activity，onCreate，onStart，onResume。会通过WindowManagerService冻结屏幕并设置Activity可见。

2.  handleLaunchActivity -> performLaunchActivity -> newActivity -> makeApplication -> init -> attach -> callActivityOnCreate -> performCreate -> onCreate -> performStart -> callActivityOnStart -> onStart -> callActivityOnPostCreate -> onPostCreate

3.  handleResumeActivity -> performResumeActivity -> onResume 控制可见性，如果在onResume时，又启动另一个Activity则窗口变不可见，黑屏可能由此来。onResume之前可能会有onNewIntent与onActivityResult调用

4.  如果当前Activity处于stop状态，onRestart -> onStart -> onResume -》onPostResme

5.  Activity.finish只是标志一下Activity处于完成的状态，会在IdleHandle线程中销毁

停止源Activity，在目标Activity的onCreate、onStart、onResume、activityIdleInternal执行后，开始停止源Activity。

1.  FLAG<sub>ACTIVITY</sub><sub>NO</sub><sub>HISTORY启动标记的Activity是不会被放入栈中的</sub>。
2.  onSaveInstanceState -》 onStop
3.  StopInfo通知ActivityManagerService停止Activity的操作完成


<a id="org0d6dbed"></a>

### Activity Manager进程管理

非隐藏进程：

-   有可见但非前台的activity
-   有可见activity，该进程未被完全覆盖的Activity
-   处于Pausing和Paused状态的activity
-   处于STOPPING状态的Activity
-   AMS.setProcessForeground
-   HOME进程
-   运行在内核空间中的进程
-   当前线程的上一个线程
-   备份线程

/sys/module/lowmemorykiller/paramerters/adj 优先级数
/sys/module/lowmemorykiller/paramerters/minfree 对应的内存阀值

lowmem<sub>shrink</sub>:

-   OOM adj越大的进程越容易被杀
-   相同OOM adj的进程，占用内存越大的越容易被杀
-   未达到最小内存阈值的最大值时，不会杀

